waveshareteam/ESP32-P4-NANO-WIFI6-DB/firmware/esp32_p4_nano_wifi6_db/esp32_p4_nano_wifi6_db.c
    static const uint8_t gt911_addresses[] = {
        ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS,
        ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS_BACKUP,
    };

    *ret_touch = NULL;
    esp_err_t ret = ESP_FAIL;
    for (size_t i = 0; i < sizeof(gt911_addresses) / sizeof(gt911_addresses[0]); i++) {
        esp_lcd_panel_io_i2c_config_t io_config = ESP_LCD_TOUCH_IO_I2C_GT911_CONFIG();
        io_config.dev_addr = gt911_addresses[i];

        esp_lcd_panel_io_handle_t io_handle = NULL;
        ret = esp_lcd_new_panel_io_i2c(bsp_i2c_get_handle(), &io_config, &io_handle);
        if (ret != ESP_OK) {
            ESP_LOGW(LCD_TAG, "Create GT911 I2C IO at 0x%02X failed: %s",
                     io_config.dev_addr, esp_err_to_name(ret));
            continue;
        }

        esp_lcd_touch_io_gt911_config_t gt911_config = {
            .dev_addr = io_config.dev_addr,
        };
        const esp_lcd_touch_config_t touch_config = {
            .x_max = BSP_LCD_H_RES,
            .y_max = BSP_LCD_V_RES,
            .rst_gpio_num = BSP_LCD_TOUCH_RST,
            .int_gpio_num = BSP_LCD_TOUCH_INT,
            .levels = {
                .reset = 0,
                .interrupt = 0,
            },
            .flags = {
                .swap_xy = config ? config->flags.swap_xy : 0,
                .mirror_x = config ? config->flags.mirror_x : 0,
                .mirror_y = config ? config->flags.mirror_y : 0,
            },
            .driver_data = &gt911_config,
        };

        ret = esp_lcd_touch_new_i2c_gt911(io_handle, &touch_config, ret_touch);
        if (ret == ESP_OK) {
            ESP_LOGI(LCD_TAG, "GT911 detected at I2C address 0x%02X", io_config.dev_addr);
            s_touch = *ret_touch;
            s_touch_io = io_handle;
            return ESP_OK;
        }

        ESP_LOGW(LCD_TAG, "GT911 not found at I2C address 0x%02X: %s",
                 io_config.dev_addr, esp_err_to_name(ret));
        esp_lcd_panel_io_del(io_handle);
    }
    return ret;
}

void bsp_touch_delete(void)
{
    if (s_touch != NULL) {
        (void)esp_lcd_touch_del(s_touch);
        s_touch = NULL;
    }
    if (s_touch_io != NULL) {
        (void)esp_lcd_panel_io_del(s_touch_io);
        s_touch_io = NULL;
    }
}

#if (BSP_CONFIG_NO_GRAPHIC_LIB == 0)
static lv_display_t *bsp_display_lcd_init(const bsp_display_cfg_t *config)
{
    const bsp_display_config_t hw_config = {
        .dsi_bus = {
            .phy_clk_src = 0,
            .lane_bit_rate_mbps = BSP_LCD_MIPI_DSI_LANE_BITRATE_MBPS,
        },
        .num_fbs = esp_lv_adapter_get_required_frame_buffer_count(config->tear_avoid_mode,
                                                                  config->rotation),
    };
    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_new_with_handles(&hw_config, &s_display_handles));

    esp_lv_adapter_display_config_t display_config =
        ESP_LV_ADAPTER_DISPLAY_MIPI_DEFAULT_CONFIG(s_display_handles.panel,
                                                   s_display_handles.io,
                                                   BSP_LCD_H_RES,
                                                   BSP_LCD_V_RES,
                                                   config->rotation);
    display_config.tear_avoid_mode = config->tear_avoid_mode;
    return esp_lv_adapter_register_display(&display_config);
}

static lv_indev_t *bsp_display_touch_init(lv_display_t *display,
                                          const bsp_display_cfg_t *config)
{
    const bsp_touch_config_t touch_config = {
        .flags = {
            .swap_xy = config->touch_flags.swap_xy,
            .mirror_x = config->touch_flags.mirror_x,
            .mirror_y = config->touch_flags.mirror_y,
        },
    };
    if (bsp_touch_new(&touch_config, &s_touch) != ESP_OK) {
        return NULL;
    }

    const esp_lv_adapter_touch_config_t adapter_touch_config =
        ESP_LV_ADAPTER_TOUCH_DEFAULT_CONFIG(display, s_touch);
    return esp_lv_adapter_register_touch(&adapter_touch_config);
}

lv_display_t *bsp_display_start(void)
{
    bsp_display_cfg_t config = {
        .lv_adapter_cfg = ESP_LV_ADAPTER_DEFAULT_CONFIG(),
        .rotation = ESP_LV_ADAPTER_ROTATE_0,
        .tear_avoid_mode = ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_PARTIAL,
        .touch_flags = {
            .swap_xy = 0,
            .mirror_x = 0,
            .mirror_y = 0,
        },
    };
    return bsp_display_start_with_config(&config);
}

lv_display_t *bsp_display_start_with_config(const bsp_display_cfg_t *config)
{
    if (config == NULL) {
        ESP_LOGE(LCD_TAG, "Display configuration is NULL");
        return NULL;
    }

    esp_err_t ret = esp_lv_adapter_init(&config->lv_adapter_cfg);
    if (ret != ESP_OK) {
        ESP_LOGE(LCD_TAG, "Initialize LVGL adapter failed: %s", esp_err_to_name(ret));
        return NULL;
    }

    s_display = bsp_display_lcd_init(config);
    if (s_display == NULL) {
        ESP_LOGE(LCD_TAG, "Register display with LVGL adapter failed");
        goto err;
    }

    s_touch_indev = bsp_display_touch_init(s_display, config);
    if (s_touch_indev == NULL) {
        ESP_LOGW(LCD_TAG, "Touch unavailable; continuing without LVGL input device");
        bsp_touch_delete();
    }

    ret = esp_lv_adapter_start();
    if (ret != ESP_OK) {
        ESP_LOGE(LCD_TAG, "Start LVGL adapter failed: %s", esp_err_to_name(ret));
        goto err;
    }
    return s_display;

err:
    if (s_touch_indev != NULL) {
        esp_lv_adapter_unregister_touch(s_touch_indev);
        s_touch_indev = NULL;
    }
    bsp_touch_delete();
    if (s_display != NULL) {
        esp_lv_adapter_unregister_display(s_display);
        s_display = NULL;
    }
    bsp_display_delete();
    esp_lv_adapter_deinit();
    return NULL;
}

void bsp_display_stop(lv_display_t *display)
{
    if (s_touch_indev != NULL) {
        esp_lv_adapter_unregister_touch(s_touch_indev);
        s_touch_indev = NULL;
    }
    lv_display_t *display_to_remove = display ? display : s_display;
    if (display_to_remove) {
        esp_lv_adapter_unregister_display(display_to_remove);
    }
    esp_lv_adapter_deinit();
    bsp_touch_delete();
    bsp_display_delete();
    s_display = NULL;
}

